app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("item_name", "price", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_name", "Japan"], ["price", 1.0], ["description", "japan"], ["user_id", 4], ["created_at", "2020-05-08 18:45:05.998986"], ["updated_at", "2020-05-08 18:45:05.998986"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["price", 1.01], ["updated_at", "2020-05-08 18:45:12.145325"], ["id", 9]]