app/controllers/pages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "lance@student.com"], ["LIMIT", 1]]
---
    def create_login

        user = User.find_by_email(params[:email])